arch/regression_results/AC20-FZK-Haus/OpenFOAM/solar/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.5                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"constant";
	object		radiationProperties;
}

fvDOMCoeffs
{

    nPhi		3;

    nTheta		5;

    tolerance		1e-3;

    maxIter		5;

    useSolarLoad		false;

    useExternalBeam		false;

}

solarLoadCoeffs
{

    reflecting
    {

        nPhi		10;

        nTheta		10;

    }

    sunDirectionModel		constant;

    sunDirection		(0 -1 -1);

    spectralDistribution		(1);

    sunLoadModel		constant;

    directSolarRad		100;

    diffuseSolarRad		0;

    solidCoupled		false;

    wallCoupled		true;

    useReflectedRays		true;

}

constantAbsorptionEmissionCoeffs
{

    absorptivity		absorptivity [m^-1] 0.01;

    emissivity		emissivity [m^-1] 0.01;

    E		E [kg m^-1 s^-3] 0;

}

useSolarLoad		false;

radiation		on;

radiationModel		fvDOM;

solverFreq		10;

absorptionEmissionModel		constantAbsorptionEmission;

sootModel		none;

scatterModel		none;

transmissivityModel		none;