arch/regression_results/AC20-FZK-Haus/OpenFOAM/solar/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.5                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		blockMeshDict;
}

convertToMeters 1.0000;

vertices
(
	(0.2 5.89 -0.1)
	(3.9 5.89 -0.1)
	(3.9 9.8 -0.1)
	(0.2 9.8 -0.1)
	(0.2 5.89 2.79592)
	(3.9 5.89 2.79592)
	(3.9 9.8 2.79592)
	(0.2 9.8 2.79592)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (37 39 29) 
simpleGrading (
	1.0
	1.0
	1.0
	)
);

edges
(
);

boundary
(   boundingbox
   {
       type wall;
       faces
       (       
	(0 3 2 1)
	(4 5 6 7)
	(1 2 6 5)
	(3 0 4 7)
	(0 1 5 4)
	(2 3 7 6)
       );
   }
);

mergePatchPair
(
);
