arch/regression_results/AC20-FZK-Haus/OpenFOAM/solar/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.5                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		decomposeParDict;
}

numberOfSubdomains		12;

method		hierarchical;

hierarchicalCoeffs
{

    n		(3 2 2);

    delta		1e-3;

    order		xyz;

}

distributed		no;